<div class="row">
        <div class="col-lg-9">
            <h1>626.Exchange Seats</h1>
            <div class="markdown-body" style="margin-top: 20px">
                <p>Mary is a teacher in a middle school and she has a table <code>seat</code> storing students&#39; names and their corresponding seat ids.</p>
The column <b>id</b> is continuous increment.

<p>&nbsp;</p>
Mary wants to change seats for the adjacent students.

<p>&nbsp;</p>
Can you write a SQL query to output the result for Mary?

<p>&nbsp;</p>

<pre>
+---------+---------+
|    id   | student |
+---------+---------+
|    1    | Abbot   |
|    2    | Doris   |
|    3    | Emerson |
|    4    | Green   |
|    5    | Jeames  |
+---------+---------+
</pre>
For the sample input, the output is:

<p>&nbsp;</p>

<pre>
+---------+---------+
|    id   | student |
+---------+---------+
|    1    | Doris   |
|    2    | Abbot   |
|    3    | Green   |
|    4    | Emerson |
|    5    | Jeames  |
+---------+---------+
</pre>

<p><b>Note:</b><br />
If the number of students is odd, there is no need to change the last one&#39;s seat.</p>

In [1]:
import sqlalchemy
import pandas as pd
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:newpass_1234@localhost:3306/sys')

In [2]:
seat = pd.read_sql_table("seat", engine)
seat

   id  student
0   1    Abbot
1   2    Doris
2   3  Emerson
3   4    Green
4   5   Jeames

In [3]:
query = '''
SELECT IF(mod(cnt, 2) = 1 AND id = cnt, 
         id,
         IF(mod(id, 2) = 1, 
            id + 1, 
            id - 1)) AS id, 
        student
FROM seat,
     (SELECT COUNT(*) AS cnt FROM seat) AS t
ORDER BY id;
'''
pd.read_sql_query(query, engine)

   id  student
0   1    Doris
1   2    Abbot
2   3    Green
3   4  Emerson
4   5   Jeames

Note:

x % y ==> mod(x, y)

1. set a new table with total count of elements in original table
2. condition output

(1) if odd total and seq = total, keep original;

(2) else if seq even, move forward one step;

(3) else move backward one step.